### series Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series

In [3]:
s1 = Series([1,2,3,4,5,4,3])

In [4]:
s1

0    1
1    2
2    3
3    4
4    5
5    4
6    3
dtype: int64

In [5]:
s2 = Series(['A','B','C'])

In [6]:
s2

0    A
1    B
2    C
dtype: object

In [7]:
s3 = Series([1,2,3,4,5],index = [10,20,30,40,50])

In [8]:
s3

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [9]:
s4 = Series ([10,20,30,40,50],index= ['A', 'B', 'C', 'D', 'E'])

In [10]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [11]:
s4

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [12]:
s5 = Series(np.array([1,2,3,4,5,5]))

In [13]:
s5

0    1
1    2
2    3
3    4
4    5
5    5
dtype: int32

In [14]:
s5 = Series(np.arange(5,51,10))

In [15]:
s5

0     5
1    15
2    25
3    35
4    45
dtype: int32

In [16]:
s6 = Series ({'A': 55,'B':100,'C':150})

In [17]:
s6

A     55
B    100
C    150
dtype: int64

In [18]:
s6.values

array([ 55, 100, 150], dtype=int64)

In [19]:
s6.index

Index(['A', 'B', 'C'], dtype='object')

### Pandas DataFrame3

In [20]:
import numpy as np
import pandas as pd

In [21]:
from pandas import DataFrame

In [22]:
df1 = DataFrame(np.arange(1,26).reshape(5,5))

In [23]:
df1

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [24]:
df2 = DataFrame(np.arange(1,26).reshape(5,5),index =list('ABCDE'))

In [25]:
df2

    0   1   2   3   4
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [26]:
df3 = DataFrame(np.arange(1,26).reshape(5,5),index =list('ABCDE'),columns = ['Col1','Col2','Col3','Col4','Col5'])

In [27]:
df3

   Col1  Col2  Col3  Col4  Col5
A     1     2     3     4     5
B     6     7     8     9    10
C    11    12    13    14    15
D    16    17    18    19    20
E    21    22    23    24    25

In [28]:
df4 = DataFrame([[1,2,3],[4,5,6]],index = ['a','b'],columns = ['X','Y','Z'])

In [29]:
df4

   X  Y  Z
a  1  2  3
b  4  5  6

In [30]:
 dic1 = {'Name':['John','Jim','Obama'],'Age':[55,24,77]}

In [31]:
dic1

{'Name': ['John', 'Jim', 'Obama'], 'Age': [55, 24, 77]}

In [32]:
df4 = DataFrame(dic1)

In [33]:
df4

    Name  Age
0   John   55
1    Jim   24
2  Obama   77

In [34]:
df4 = DataFrame( {'Name':['John','Jim','Obama'],'Age':[55,24,77]},index =['A','B','C'])

In [35]:
df4

    Name  Age
A   John   55
B    Jim   24
C  Obama   77

In [36]:
from pandas import Series

In [37]:
s1 = Series(['Sujit','Nitin','Walmik'],index = list('ABC'))
s2 = Series(np.random.randint(1,101,3),index= list('ABC'))

In [38]:
s1

A     Sujit
B     Nitin
C    Walmik
dtype: object

In [39]:
s2

A    70
B    89
C    97
dtype: int32

In [40]:
df5 = DataFrame()

In [41]:
df5['Name'] =s1
df5['Score 1']= s2
df5['Score 2']= s3

In [42]:
df5

     Name  Score 1  Score 2
A   Sujit       70      NaN
B   Nitin       89      NaN
C  Walmik       97      NaN

In [43]:
df5.columns

Index(['Name', 'Score 1', 'Score 2'], dtype='object')

In [44]:
df5.index

Index(['A', 'B', 'C'], dtype='object')

In [45]:
df5.values

array([['Sujit', 70, nan],
       ['Nitin', 89, nan],
       ['Walmik', 97, nan]], dtype=object)

## DATA selction- Series3

In [46]:
import numpy as pd
import pandas as pd
from pandas import Series, DataFrame

In [47]:
series1 = Series([10,20,30,40,50],index =list('ABCDE'))

In [48]:
series1

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [49]:
series1['A']#nGrab By index label

10

In [50]:
series1[0] # Grab By Index

10

In [51]:
series1[1:4] #Grab By Index Range

B    20
C    30
D    40
dtype: int64

In [52]:
series1[['A','D','B']] # Grab by Multiple Index

A    10
D    40
B    20
dtype: int64

In [53]:
series1[series1>25] #Grab By Logic

C    30
D    40
E    50
dtype: int64

In [54]:
series1[series1==40]

D    40
dtype: int64

In [55]:
series1>25

A    False
B    False
C     True
D     True
E     True
dtype: bool

### Data Selection - DataFrame

In [56]:
import numpy as pd
import pandas as pd
from pandas import Series , DataFrame

In [57]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),index =list('UVXYZ'),columns = list('ABCDE'))

In [58]:
df1

    A   B   C   D   E
U   1   2   3   4   5
V   6   7   8   9  10
X  11  12  13  14  15
Y  16  17  18  19  20
Z  21  22  23  24  25

In [59]:
df1['A']# Garb By Column Name

U     1
V     6
X    11
Y    16
Z    21
Name: A, dtype: int32

In [60]:
df1[['A','D','B']]# Grab By Multiple Colume Name

    A   D   B
U   1   4   2
V   6   9   7
X  11  14  12
Y  16  19  17
Z  21  24  22

In [61]:
df1[1:4]

    A   B   C   D   E
V   6   7   8   9  10
X  11  12  13  14  15
Y  16  17  18  19  20

In [62]:
df1[df1['C']>15]

    A   B   C   D   E
Y  16  17  18  19  20
Z  21  22  23  24  25

In [63]:
df1['C']>15

U    False
V    False
X    False
Y     True
Z     True
Name: C, dtype: bool

In [64]:
df1>15

       A      B      C      D      E
U  False  False  False  False  False
V  False  False  False  False  False
X  False  False  False  False  False
Y   True   True   True   True   True
Z   True   True   True   True   True

In [65]:
df1<15

       A      B      C      D      E
U   True   True   True   True   True
V   True   True   True   True   True
X   True   True   True   True  False
Y  False  False  False  False  False
Z  False  False  False  False  False

### Reindexing

In [66]:
import numpy as np
import pandas as pd
from pandas import Series , DataFrame

In [67]:
ser1 = Series([10,20,30], index = list('ABC'))

In [68]:
ser1

A    10
B    20
C    30
dtype: int64

In [69]:
ser1.reindex(list('ABCDEFGH'),fill_value=5)

A    10
B    20
C    30
D     5
E     5
F     5
G     5
H     5
dtype: int64

In [70]:
ser1.reindex(list('AAABBBCCGH'),fill_value=5)

A    10
A    10
A    10
B    20
B    20
B    20
C    30
C    30
G     5
H     5
dtype: int64

In [71]:
ser1 =ser1.reindex(list('AAABBBCCGH'),fill_value=5)

In [72]:
ser1

A    10
A    10
A    10
B    20
B    20
B    20
C    30
C    30
G     5
H     5
dtype: int64

In [73]:
ser1['A']

A    10
A    10
A    10
dtype: int64

In [74]:
ser2 = Series(['India','USA','Nepal'],index = [1,5,7])

In [75]:
ser2

1    India
5      USA
7    Nepal
dtype: object

In [76]:
ser2.reindex(range(15))

0       NaN
1     India
2       NaN
3       NaN
4       NaN
5       USA
6       NaN
7     Nepal
8       NaN
9       NaN
10      NaN
11      NaN
12      NaN
13      NaN
14      NaN
dtype: object

In [77]:
ser2.reindex(range(15),method = 'ffill')

0       NaN
1     India
2     India
3     India
4     India
5       USA
6       USA
7     Nepal
8     Nepal
9     Nepal
10    Nepal
11    Nepal
12    Nepal
13    Nepal
14    Nepal
dtype: object

In [78]:
ser2.reindex(range(15),method ='bfill')

0     India
1     India
2       USA
3       USA
4       USA
5       USA
6     Nepal
7     Nepal
8       NaN
9       NaN
10      NaN
11      NaN
12      NaN
13      NaN
14      NaN
dtype: object

In [79]:
ser2.reindex(range(15),method= 'nearest')

0     India
1     India
2     India
3       USA
4       USA
5       USA
6     Nepal
7     Nepal
8     Nepal
9     Nepal
10    Nepal
11    Nepal
12    Nepal
13    Nepal
14    Nepal
dtype: object

### Loc & iloc3

In [80]:
import numpy as pd
import pandas as pd
from pandas import Series, DataFrame

In [81]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),index = list('ABCDE'),columns = ['C1','C2','C3','C4','C5'])

In [82]:
df1

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [83]:
df1['C1']

A     1
B     6
C    11
D    16
E    21
Name: C1, dtype: int32

In [84]:
import pandas as pd 
import numpy as np
from pandas import Series, DataFrame

In [85]:
df2 = DataFrame(np.arange(1,26).reshape(5,5),index = list('ABCDE'),columns = ['C1','C2','C3','C4','C5'])
df2

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [86]:
df2.loc['A']

C1    1
C2    2
C3    3
C4    4
C5    5
Name: A, dtype: int32

In [87]:
df1.loc[['A','C']]

   C1  C2  C3  C4  C5
A   1   2   3   4   5
C  11  12  13  14  15

In [88]:
df1.loc['A','C1']

1

In [89]:
df1.loc[:,'C5']

A     5
B    10
C    15
D    20
E    25
Name: C5, dtype: int32

In [90]:
df1.loc[['A','C'],'C5']

A     5
C    15
Name: C5, dtype: int32

In [91]:
df1.loc[['A','C'],['C1','C5']]

   C1  C5
A   1   5
C  11  15

In [92]:
df1

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [93]:
df1.iloc[0]

C1    1
C2    2
C3    3
C4    4
C5    5
Name: A, dtype: int32

In [94]:
df1.iloc[1:4]

   C1  C2  C3  C4  C5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20

In [95]:
df1.iloc[:,0]

A     1
B     6
C    11
D    16
E    21
Name: C1, dtype: int32

In [96]:
df1.iloc[:,1:4]

   C2  C3  C4
A   2   3   4
B   7   8   9
C  12  13  14
D  17  18  19
E  22  23  24

In [97]:
df1.iloc[0,0]

1

### Sorting Pandas3

In [98]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [99]:
s1 = Series(np.random.randint(1,101,10))
s1

0    40
1    80
2    37
3    69
4    15
5    85
6    62
7    28
8    30
9    30
dtype: int32

In [100]:
s1.sort_values()

4    15
7    28
8    30
9    30
2    37
0    40
6    62
3    69
1    80
5    85
dtype: int32

In [101]:
s1.sort_values(ascending=False)

5    85
1    80
3    69
6    62
0    40
2    37
8    30
9    30
7    28
4    15
dtype: int32

In [102]:
s1

0    40
1    80
2    37
3    69
4    15
5    85
6    62
7    28
8    30
9    30
dtype: int32

In [103]:
s1 = s1.sort_values(ascending=False)
s1

5    85
1    80
3    69
6    62
0    40
2    37
8    30
9    30
7    28
4    15
dtype: int32

In [104]:
s1.sort_index()

0    40
1    80
2    37
3    69
4    15
5    85
6    62
7    28
8    30
9    30
dtype: int32

In [105]:
s1.sort_index(ascending=False)

9    30
8    30
7    28
6    62
5    85
4    15
3    69
2    37
1    80
0    40
dtype: int32

In [106]:
df3 = DataFrame()

In [107]:
s1.sort_index(inplace = True)

In [108]:
df3['Name'] = list('ABCDEFGHIJ')
df3['Marks'] = s1
df3['Marks2'] = np.random.randint(1,101,10)

In [109]:
df3

  Name  Marks  Marks2
0    A     40      74
1    B     80      93
2    C     37      89
3    D     69      92
4    E     15       3
5    F     85      83
6    G     62      80
7    H     28      28
8    I     30      81
9    J     30      65

In [110]:
df3.iloc[0:2,1]= 17
df3

  Name  Marks  Marks2
0    A     17      74
1    B     17      93
2    C     37      89
3    D     69      92
4    E     15       3
5    F     85      83
6    G     62      80
7    H     28      28
8    I     30      81
9    J     30      65

In [111]:
df3.sort_values(by ='Marks')

  Name  Marks  Marks2
4    E     15       3
0    A     17      74
1    B     17      93
7    H     28      28
8    I     30      81
9    J     30      65
2    C     37      89
6    G     62      80
3    D     69      92
5    F     85      83

In [112]:
df3.sort_values(by='Marks',ascending=False)

  Name  Marks  Marks2
5    F     85      83
3    D     69      92
6    G     62      80
2    C     37      89
8    I     30      81
9    J     30      65
7    H     28      28
0    A     17      74
1    B     17      93
4    E     15       3

In [113]:
df3.sort_values(by='Marks',ascending=False,inplace = True)

In [114]:
df3.sort_index()

  Name  Marks  Marks2
0    A     17      74
1    B     17      93
2    C     37      89
3    D     69      92
4    E     15       3
5    F     85      83
6    G     62      80
7    H     28      28
8    I     30      81
9    J     30      65

In [115]:
df3.sort_index(inplace=True)

In [116]:
df3

  Name  Marks  Marks2
0    A     17      74
1    B     17      93
2    C     37      89
3    D     69      92
4    E     15       3
5    F     85      83
6    G     62      80
7    H     28      28
8    I     30      81
9    J     30      65

In [119]:
df3.sort_values(by=['Marks','Marks2'],ascending = [True,False])

  Name  Marks  Marks2
4    E     15       3
1    B     17      93
0    A     17      74
7    H     28      28
8    I     30      81
9    J     30      65
2    C     37      89
6    G     62      80
3    D     69      92
5    F     85      83

In [120]:
df3.sort_values(by=['Marks','Marks2'],ascending = [False,False])

  Name  Marks  Marks2
5    F     85      83
3    D     69      92
6    G     62      80
2    C     37      89
8    I     30      81
9    J     30      65
7    H     28      28
1    B     17      93
0    A     17      74
4    E     15       3

### Ranks In Pandas33